// && - І
// || - Або
// ! - НЕ

// Я піду гуляти, якщо помию посуд і зроблю домашнє завдання.

// true - true - Ідем гуляти
// true- false - сидим дома
// false- true - сидим дома
// false- false - сидим дома

// || - АБО

// Я піду гуляти, якщо помию посуд або зроблю домашнє завдання.

// true - true - Ідем гуляти
// true- false - Ідем
// false- true - Ідем
// false- false - сидим дома

// ! - НЕ

// !true - Не тру - фалсе
// !false - не фалс - труе

// undefind , none, 0, "", null, false - все це прирівнюється до false

console.log("" && "Петро");

console.log("" || "Петро");

// console.log( & | ); - побітові операції
